import { useState } from 'react'
import{createBrowserRouter, RouterProvider} from 'react-router-dom'
import imgPPK100 from "./assets/images/PPK100.jpg"
import imgPPK1001 from "./assets/images/PPK100-1.jpg"
import sami from "./assets/images/sami.jpg"

import imgPPK102 from "./assets/images/PPK102.jpg"
import imgPPK1021 from "./assets/images/ppk1021.jpg"
import imgPPK1022 from "./assets/images/ppk1022.jpg"

import imgPPK101 from "./assets/images/PPK101.jpg"
import imgPPK1012 from "./assets/images/PPK1012.jpg"


import file100 from "./assets/PDF/PPK-100.pdf"
import file101 from "./assets/PDF/PPK-101.pdf"
import file102 from "./assets/PDF/PPK-102.pdf"


// import './App.css'
import Home from './pages/home'
import Product from './pages/product'
import Results from './pages/results.jsx'
import AboutUs from './pages/aboutUs.jsx'
import ContactUs from './pages/contactUs.jsx'
import Login from './pages/login.jsx'
import Signup from './pages/signup.jsx'
import { Footer } from './components/footer'
import NotFound from './pages/notFound.jsx'


const router=createBrowserRouter([
  {
    path:"/",
    element:<Home props={{
      description:"تولید کننده محصولات نفوذناپذیر و آبگریز کننده ی نانو",
      images:["./Image/PPK101.jpg", "./Image/PPk102.jpg", "./Image/photo_2023-07-14_01-27-46.jpg"],

    }}/>,
    errorElement:<NotFound/>
  },
  {
    path:"/products",
    element:<Product/>
  },
  {
    path:"/products/PPK-100",
    element:<Product props={{
          description: `یکی از عمدهترین مشکلات انواع بتنها و ملات‌های سیمانی،
نفوذپذیری آن‌ها در برابر آب و به واسطه آن انواع یون‌های
خورنده مانند کلر یا ترکیبات گوگردی است. این عامل باعث
ایجاد خوردگی در مواد سیمانی گشته و با نفوذ آب به داخل بتن
و ایجاد اکسیداسیون فلزات به‌کار رفته در داخل بتن، عمر سازه
بتنی را کاهش می‌دهد. امروزه روش‌های متعددی برای کاهش
نفوذ آب به سازه‌های بتنی و ملات‌های سیمانی استفاده می‌شود.
افزودنی  PPK-100که به‌صورت پودر خاکستری رنگ می‌باشد،
با بهره‌گیری از فناوری نانو، موجب نفوذ ناپذیری کل حجم سازه
بتنی یا ملات سیمانی استفاده شده می‌گردد و با ایجاد خاصیت
آبگریزی سطح، از غبارگرفتن و لک شدن آن جلوگیری می ‌کند.
ماده استفاده شده در این محصول میکروذرات سیلیس هستند
که با اصلاح سطح آن‌ها این میکروذرات فوق آبگریز گشته و با دو
عملکرد می‌تواند مانع نفوذ آب به داخل سازه شوند. اول اینکه به
دلیل اندازه بسیار کوچک این ذرات، در منافذ سازه بتنی جای
گرفته و با پر کردن آن‌ها نفوذ آب را کاهش می‌دهند و دوم آن‌که
این میکروذرات ابرآبگریز بوده و بدین وسیله نیز مانع نفوذ آب و
سایریون‌های خورنده به داخل سازه می‌شوند. این کاربرد دوگانه
محصول  PPK-100را به یک محصول منحصربفرد در
نفوذناپذیری سازه‌های بتنی تبدیل کرده است. مواد به‌کار رفته در
این محصول مواد طبیعی بوده و هیچ ماده مصنوعی در آن به‌کار
نرفته است`,
          title: `افزودنی نفوذناپذیر کننده بتن و ملات سیمانی`,
          name: `(PPK-100)`,
          images: [
            imgPPK100,
            imgPPK1001,
            sami,
          ],
          usages: [
            `نفوذناپذیری و آب بندی ملاتهای سیمانی و پلاستر ها`,
            `نفوذناپذیری و آب‌بندی در کل حجم سازههای بتنی`,
            `کاهش نفوذپذیری و آب‌بندی انواع مخازن بتنی مانند
          استخرهای آب و سازههای بتنی فاضلاب شهری`,
            `نفوذناپذیری چالههای آسانسور`,
            `جلوگیری از نفوذ یونهای خورنده مانند کلر به سازههای در
          معرض این یونها`,
            `نفوذناپذیری و آببندی سقفها و شناژ‌های بتنی`,
            `استفاده در دوغابها و ملاتهای انواع موزاییک و سرامیک در
          سرویسهای بهداشتی به منظور عدم نفوذ آب بین دیوارهای
          منازل و سقفهای ساختمانهای طبقاتی`,
            `استفاده در بندکشی انواع کاشی، سرامیک، آجر و ... به منظور
          نفوذناپذیری کامل بندها در برابر آب و عدم شوره زدن، جرم
          گرفتن و تغییر رنگ بندها`,
          ],
          instructions: `ابتدا افزودنی آب‌گریز به میزان لازم (بسته به
            نفوذناپذیری مورد نیاز) با پودر سنگ یا ماسه به صورت خشک
            مخلوط شده و سپس با سیمان مخلوط گردد و در نهایت آب به
            آرامی به آنها اضافه شود
            میزان افزودنی پیشنهادی برای ملاتهای سیمانی  5تا 10
            درصد وزن کل مصالح (سیمان + ماسه (پودر سنگ)) بسته به
            نفوذناپذیری مورد نیاز است.
            میزان افزودنی پیشنهادی برای سازههای بتنی  1.5تا  8درصد
            وزن سیمان بسته به نفوذناپذیری مورد نیاز است.
            در محل خشک نگهداری شود. بهترین عملکرد محصول پس از
            خشک شدن کامل ایجاد میشود و بهتر است تست نفوذپذیری
            یا شستشو پس از خشک شدن انجام گیرد. این مدت از چند
            هفته برای ملاتها و پلاسترهای سیمانی و تا چند ماه برای بتن
            متغیر است`,
          file: {file100},
        }}/>,
    errorElement:<NotFound/>
  },
  {
    path:"/products/PPK-101",
    element:<Product props={{
          description: `این عامل باعث ایجارد خوردگی در خود مواد سیمانی گشته و
حتی با نفوذ آب به داخل سازه می تواند منجر به خسارات جبران
ناپذیر شود. امروزه روشهای متعددی برای کاهش نفوذ آب به
سازه های سیمانی استفاده می شوند.
یکی از عمدهترین مشکلات انواع بتنها و ملات‌های سیمانی،
نفوذپذیری آن‌ها در برابر آب است. این عامل باعث ایجاد
خوردگی در خود مواد سیمانی گشته و حتی با نفوذ آب به داخل
سازه می تواند منجر به خسارات جبران ناپذیر شود. امروزه
روش‌های متعددی برای کاهش نفوذ آب به سازه‌های بتنی و
ملات‌های سیمانی استفاده می‌شود.
•افزودنی  PPK-101که به صورت پودری سفیدرنگ می باشد.
با بهره‌گیری از فناوری نانو، موجب نفوذ ناپذیری کل حجم سازه
بتنی یا ملات سیمانی استفاده شده می‌گردد و با ایجاد خاصیت
فوق آب‌گریزی سطح، از غبارگرفتن و لک شدن آن جلوگیری
می‌کند. در این محصول از ریزذرات اصلاح سطح شده استفاده
شده است که با اصلاح سطح آن‌ها این ریزذرات فوق آب‌گریز
گشته و مانع نفوذ آب به داخل سازه می‌شوند. ایجاد خاصیت
آب‌گریزی در کل حجم ملات یا پلاستر استفاده شده مزیت اصلی
استفاده از محصول  PPK-101است و به همین دلیل آن را یک
محصول خاص برای استفاده در نفوذناپذیری انواع ملات‌ها و
پلاسترها کرده است. رنگ کاملا سفید این محصول هیچ تغییری
در نماهای سیمان سفید ایجاد نمی‌کند و با استفاده از این
محصول از نفوذ آب کاملا جلوگیری می شود. مواد به‌کار رفته در`,
          title: "افزودنی نفوذناپذیر کننده ملات سیمانی",
          name: `(PPK-101)`,
          images: [
            imgPPK101,
            imgPPK1012,
          ],
          usages: [`نفوذناپذیری و آب بندی ملاتهای سیمانی و پلاستر ها`, `نفوذناپذیری و آب‌بندی در کل حجم سازههای بتنی`, `کاهش نفوذپذیری و آب‌بندی انواع مخازن بتنی مانند
    استخرهای آب و سازههای بتنی فاضلاب شهری`, `نفوذناپذیری چالههای آسانسور`, `جلوگیری از نفوذ یونهای خورنده مانند کلر به سازههای در
    معرض این یونها`, `نفوذناپذیری و آببندی سقفها و شناژ‌های بتنی`, `استفاده در دوغابها و ملاتهای انواع موزاییک و سرامیک در
    سرویسهای بهداشتی به منظور عدم نفوذ آب بین دیوارهای
    منازل و سقفهای ساختمانهای طبقاتی`, `استفاده در بندکشی انواع کاشی، سرامیک، آجر و ... به منظور
    نفوذناپذیری کامل بندها در برابر آب و عدم شوره زدن، جرم
    گرفتن و تغییر رنگ بندها`],
          instructions: `ابتدا افزودنی آب‌گریز به میزان لازم (بسته به
    نفوذناپذیری مورد نیاز) با پودر سنگ یا ماسه به صورت خشک
    مخلوط شده و سپس با سیمان مخلوط گردد و در نهایت آب به
    آرامی به آنها اضافه شود
    میزان افزودنی پیشنهادی برای ملاتهای سیمانی  5تا 10
    درصد وزن کل مصالح (سیمان + ماسه (پودر سنگ)) بسته به
    نفوذناپذیری مورد نیاز است.
    میزان افزودنی پیشنهادی برای سازههای بتنی  1.5تا  8درصد
    وزن سیمان بسته به نفوذناپذیری مورد نیاز است.
    در محل خشک نگهداری شود. بهترین عملکرد محصول پس از
    خشک شدن کامل ایجاد میشود و بهتر است تست نفوذپذیری
    یا شستشو پس از خشک شدن انجام گیرد. این مدت از چند
    هفته برای ملاتها و پلاسترهای سیمانی و تا چند ماه برای بتن
    متغیر است`,
          file: {file101},
        }}/>,
    errorElement:<NotFound/>
  },
  {
    path:"/products/PPK-102",
    element:<Product props={{
          description: `یکی از عمدهترین مشکلات انواع بتنها و ملات‌های سیمانی،
نفوذپذیری آن‌ها در برابر آب است. این عامل باعث ایجاد
خوردگی در خود مواد سیمانی گشته و حتی با نفوذ آب به داخل
سازه می تواند منجر به خسارات جبران ناپذیر شود. امروزه
روش‌های متعددی برای کاهش نفوذ آب به سازه‌های بتنی و
ملات‌های سیمانی استفاده می‌شود.
•افزودنی  PPK-102که به صورت پودری سفیدرنگ می باشد.
با بهره¬گیری از فناوری نانو، نفوذ ناپذیری را در کل حجم ملات
سیمانی استفاده شده ایجاد کرده با ایجاد خاصیت فوق آب‌گریزی
سطح، از غبارگرفتن و لک شدن آن جلوگیری می‌کند. در این
محصول از ریزذرات اصلاح سطح شده استفاده شده است که با
اصلاح سطح آن‌ها این ریزذرات فوق آب‌گریز گشته و مانع نفوذ
آب به داخل سازه می‌شوند. ایجاد خاصیت آب‌گریزی در کل
حجم ملات یا پلاستر استفاده شده مزیت اصلی استفاده از
محصول  PPK-102است و به همین دلیل آن را یک محصول
منحصربفرد برای استفاده در نفوذناپذیری انواع ملات‌ها و
پلاسترها کرده است. رنگ کاملا سفید این محصول هیچ تغییری
در نماهای سیمان سفید ایجاد نمی‌کند و با استفاده از این
محصول از نفوذ آب کاملا جلوگیری می شود. مواد به‌کار رفته در
این محصول مواد طبیعی بوده و هیچ ماده مصنوعی در آن به‌کار
نرفته است`,
          title: `افزودنی نفوذناپذیر کننده کاهگل و بناهای تاریخی`,
          name: `(PPK-102)`,
          images: [
            imgPPK102,
            imgPPK1021,
            imgPPK1022,
          ],
          usages: [`نفوذناپذیری و آب بندی ملاتهای سیمانی و پلاستر ها`, `نفوذناپذیری و آب‌بندی در کل حجم سازههای بتنی`, `کاهش نفوذپذیری و آب‌بندی انواع مخازن بتنی مانند
    استخرهای آب و سازههای بتنی فاضلاب شهری`, `نفوذناپذیری چالههای آسانسور`, `جلوگیری از نفوذ یونهای خورنده مانند کلر به سازههای در
    معرض این یونها`, `نفوذناپذیری و آببندی سقفها و شناژ‌های بتنی`, `استفاده در دوغابها و ملاتهای انواع موزاییک و سرامیک در
    سرویسهای بهداشتی به منظور عدم نفوذ آب بین دیوارهای
    منازل و سقفهای ساختمانهای طبقاتی`, `استفاده در بندکشی انواع کاشی، سرامیک، آجر و ... به منظور
    نفوذناپذیری کامل بندها در برابر آب و عدم شوره زدن، جرم
    گرفتن و تغییر رنگ بندها`],
          instructions: `ابتدا افزودنی آب‌گریز به میزان لازم (بسته به
نفوذناپذیری مورد نیاز) با پودر سنگ یا ماسه به صورت خشک
مخلوط شده و سپس با سیمان مخلوط گردد و در نهایت آب به
آرامی به آنها اضافه شود
میزان افزودنی پیشنهادی برای ملاتهای سیمانی  5تا 10
درصد وزن کل مصالح (سیمان + ماسه (پودر سنگ)) بسته به
نفوذناپذیری مورد نیاز است.
میزان افزودنی پیشنهادی برای سازههای بتنی  1.5تا  8درصد
وزن سیمان بسته به نفوذناپذیری مورد نیاز است.
در محل خشک نگهداری شود. بهترین عملکرد محصول پس از
خشک شدن کامل ایجاد میشود و بهتر است تست نفوذپذیری
یا شستشو پس از خشک شدن انجام گیرد. این مدت از چند
هفته برای ملاتها و پلاسترهای سیمانی و تا چند ماه برای بتن
متغیر است`,
          file: {file102},
        }}/>,
    errorElement:<NotFound/>
  },
  {
    path:"/results",
    element:<Results/>,
    errorElement:<NotFound/>
  },
  {
    path:"/contactUs",
    element:<ContactUs/>,
    errorElement:<NotFound/>
  },
  {
    path:"/aboutUs",
    element:<AboutUs/>,
    errorElement:<NotFound/>
  },
  {
    path:"/login",
    element:<Login/>,
    errorElement:<NotFound/>
  },
  {
    path:"/signup",
    element:<Signup/>,
    errorElement:<NotFound/>
  },
  // {
  //   path:"/guide",
  //   element:<Guide/>,
  //   errorElement:<NotFound/>
  // },
]);
// const navRouter=createBrowserRouter([
//   {
//     path:"/products/:productName",
//     element:<Product/>
//   }
// ])
function App() {
  const [count, setCount] = useState(0)

  return (
    <>
      {/* <Navbar/> */}
      <RouterProvider router={router}/>
      <Footer/>
    </>
  )
}

export default App
